Please review and approve this deployment.
**Branch/Commit:** refs/heads/main / d1104c8c9962b9511842df57fce1d69cf2dba0dc
**Workflow run:** https://github.com/JohnMonteir0/LINUXtips-Giropops-Senhas/actions/runs/18211625424

**Plan (last ~500 lines):**
```
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_caller_identity.current: Reading...
data.aws_availability_zones.available: Reading...
module.eks_bottlerocket.module.kms.data.aws_partition.current[0]: Reading...
module.karpenter.data.aws_caller_identity.current: Reading...
module.karpenter_disabled.data.aws_partition.current: Reading...
module.eks_bottlerocket.data.aws_caller_identity.current[0]: Reading...
data.aws_caller_identity.current: Reading...
module.eks_bottlerocket.module.kms.data.aws_caller_identity.current[0]: Reading...
module.karpenter_disabled.data.aws_region.current: Reading...
module.karpenter.data.aws_partition.current: Reading...
module.karpenter_disabled.data.aws_partition.current: Read complete after 0s [id=aws]
module.karpenter.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks_bottlerocket.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.karpenter_disabled.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-006b9089fc5e16eb7]
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Reading...
module.karpenter.data.aws_region.current: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.karpenter.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Read complete after 0s [id=819195744]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_caller_identity.current: Read complete after 0s [id=164229328489]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks_bottlerocket.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.karpenter_disabled.data.aws_caller_identity.current: Reading...
module.eks_bottlerocket.data.aws_partition.current[0]: Reading...
module.eks_bottlerocket.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.eks_bottlerocket.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_partition.current: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_partition.current: Read complete after 0s [id=aws]
module.karpenter.aws_iam_role.controller[0]: Refreshing state... [id=KarpenterController-20251003023534383100000001]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role.this[0]: Refreshing state... [id=karpenter-node-group-20251003023534385700000003]
module.karpenter.data.aws_caller_identity.current: Read complete after 0s [id=164229328489]
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Reading...
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Read complete after 0s [id=2560088296]
module.eks_bottlerocket.aws_iam_role.this[0]: Refreshing state... [id=giropops-cluster-20251003023534385700000004]
data.aws_caller_identity.current: Read complete after 0s [id=164229328489]
module.eks_bottlerocket.data.aws_iam_policy_document.custom[0]: Reading...
module.eks_bottlerocket.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
module.eks_bottlerocket.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::164229328489:policy/giropops-cluster-20251003023534383200000002]
module.eks_bottlerocket.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=164229328489]
module.eks_bottlerocket.data.aws_caller_identity.current[0]: Read complete after 0s [id=164229328489]
module.karpenter_disabled.data.aws_caller_identity.current: Read complete after 0s [id=164229328489]
module.eks_bottlerocket.data.aws_iam_session_context.current[0]: Reading...
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.eks_bottlerocket.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::164229328489:assumed-role/gh-actions-role/gha-tf-plan-18211625424]
module.eks_bottlerocket.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=giropops-cluster-20251003023534385700000004-20251003023534695400000006]
module.eks_bottlerocket.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=giropops-cluster-20251003023534385700000004-20251003023534711700000007]
module.eks_bottlerocket.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks_bottlerocket.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3569992896]
module.eks_bottlerocket.module.kms.aws_kms_key.this[0]: Refreshing state... [id=859b343c-8127-48d2-9aa4-770c5df587de]
module.eks_bottlerocket.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=giropops-cluster-20251003023534385700000004-20251003023534727300000008]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=karpenter-node-group-20251003023534385700000003-2025100302353477110000000a]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_instance_profile.this[0]: Refreshing state... [id=karpenter-node-group-20251003023534663000000005]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=karpenter-node-group-20251003023534385700000003-20251003023534770200000009]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=karpenter-node-group-20251003023534385700000003-2025100302353480780000000b]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-05e1713b0bdd0110d]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0548ddc87d75cfb21]
module.vpc.aws_route_table.intra[0]: Refreshing state... [id=rtb-06b3d9e1ac96565c7]
aws_vpc_ipv4_cidr_block_association.pods: Refreshing state... [id=vpc-cidr-assoc-05499596b9ccedf5a]
module.eks_bottlerocket.aws_security_group.cluster[0]: Refreshing state... [id=sg-0c3fd197a4f86fa5e]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-081e59415db5a053a]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-065ab9b9e370fc080]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0d7c7f7c42bb130b0]
module.eks_bottlerocket.aws_security_group.node[0]: Refreshing state... [id=sg-005f1cf5736dd9557]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0cff6d2fc65fd9a88]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ac924698e9ef82a8]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0d3101db996c4421e]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0f9462e36de6e6940]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-052469348ca4af469]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0355eee88501565ce]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0c0d84dbdc1a9919d]
module.vpc.aws_subnet.intra[0]: Refreshing state... [id=subnet-032eadae2033522a7]
module.vpc.aws_subnet.intra[1]: Refreshing state... [id=subnet-0534280e6dd657f33]
module.vpc.aws_subnet.intra[2]: Refreshing state... [id=subnet-0546810fa78ff289e]
aws_subnet.pods["us-east-1a"]: Refreshing state... [id=subnet-00fa71ab8df6ea328]
aws_subnet.pods["us-east-1b"]: Refreshing state... [id=subnet-0adc3c11cd70602df]
aws_subnet.pods["us-east-1c"]: Refreshing state... [id=subnet-02afc1346d2ab0ef8]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-067bc588e99a1c897]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0d88be1999c508f7f]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-07902d52da8980640]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0b2ea07b9cfafdf2a]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0d3101db996c4421e1080289494]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-869060404]
module.eks_bottlerocket.aws_security_group_rule.node["allow_icmp_from_vpc"]: Refreshing state... [id=sgrule-988290225]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-3431865913]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3677662987]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-1915844165]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-97286575]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-378553742]
module.eks_bottlerocket.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-2532366641]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-2137722084]
module.eks_bottlerocket.aws_security_group_rule.node["allow_all_from_vpc"]: Refreshing state... [id=sgrule-2488071978]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-2298200396]
module.eks_bottlerocket.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-495271453]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-063e6f898e13189e3]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-05a42c7690b720fe0]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0627e1739800a713b]
module.vpc.aws_route_table_association.intra[0]: Refreshing state... [id=rtbassoc-0f04e1c271b46b46b]
module.vpc.aws_route_table_association.intra[1]: Refreshing state... [id=rtbassoc-08b9db6669edec3fc]
module.vpc.aws_route_table_association.intra[2]: Refreshing state... [id=rtbassoc-0bb083735983fa88a]
module.eks_bottlerocket.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3659107066]
aws_route_table_association.pods["us-east-1a"]: Refreshing state... [id=rtbassoc-05f61d940195c6a3f]
aws_route_table_association.pods["us-east-1c"]: Refreshing state... [id=rtbassoc-05c6fea58e903ef78]
aws_route_table_association.pods["us-east-1b"]: Refreshing state... [id=rtbassoc-0aa0d37210f4f9fa7]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-081e15a41741e3764]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0c0d84dbdc1a9919d1080289494]
module.eks_bottlerocket.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/giropops]
module.eks_bottlerocket.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::164229328489:policy/giropops-cluster-ClusterEncryption20251003023555646400000012]
module.eks_bottlerocket.aws_eks_cluster.this[0]: Refreshing state... [id=giropops]
module.eks_bottlerocket.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=giropops-cluster-20251003023534385700000004-20251003023555966400000013]
module.eks_bottlerocket.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-0ae0380b8670e271f,Environment]
module.eks_bottlerocket.aws_ec2_tag.cluster_primary_security_group["GithubRepo"]: Refreshing state... [id=sg-0ae0380b8670e271f,GithubRepo]
module.eks_bottlerocket.aws_ec2_tag.cluster_primary_security_group["Cluster"]: Refreshing state... [id=sg-0ae0380b8670e271f,Cluster]
module.eks_bottlerocket.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=giropops:arn:aws:iam::164229328489:role/gh-actions-role]
module.eks_bottlerocket.data.tls_certificate.this[0]: Reading...
module.eks_bottlerocket.time_sleep.this[0]: Refreshing state... [id=2025-10-03T02:45:50Z]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_ssm_parameter.ami[0]: Reading...
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=1692252556952594120]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_eks_access_entry.this[0]: Refreshing state... [id=giropops:arn:aws:iam::164229328489:role/karpenter-node-group-20251003023534385700000003]
module.eks_bottlerocket.data.tls_certificate.this[0]: Read complete after 0s [id=922877a0975ad078a65b8ff11ebc47b8311945c7]
module.eks_bottlerocket.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::164229328489:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/28B24FBC5E49A0D8BF425086474DD367]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].data.aws_ssm_parameter.ami[0]: Read complete after 0s [id=/aws/service/bottlerocket/aws-k8s-1.33/x86_64/latest/image_id]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_launch_template.this[0]: Refreshing state... [id=lt-0bb9bea4e02a498cb]
module.eks_bottlerocket.module.self_managed_node_group["karpenter"].aws_autoscaling_group.this[0]: Refreshing state... [id=karpenter-20251003024556398900000022]
module.eks_bottlerocket.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=giropops#arn:aws:iam::164229328489:role/gh-actions-role#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
aws_eks_addon.pod_identity_agent: Refreshing state... [id=giropops:eks-pod-identity-agent]
module.karpenter.aws_eks_pod_identity_association.karpenter[0]: Refreshing state... [id=a-ghxz12fzss9jnmxlf]
module.karpenter.aws_cloudwatch_event_rule.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-20251003024522070900000014]
module.karpenter.aws_cloudwatch_event_rule.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20251003024522076100000018]
module.network.data.aws_caller_identity.current: Reading...
module.network.data.aws_eks_cluster_auth.this: Reading...
module.network.data.aws_eks_cluster.this: Reading...
module.karpenter.aws_iam_role.node[0]: Refreshing state... [id=giropops]
module.network.data.aws_eks_cluster_auth.this: Read complete after 0s [id=giropops]
module.karpenter.aws_cloudwatch_event_rule.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-20251003024522079600000019]
module.karpenter.aws_cloudwatch_event_rule.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20251003024522072600000016]
module.network.data.aws_caller_identity.current: Read complete after 0s [id=164229328489]
data.kubectl_file_documents.letsencrypt: Reading...
module.karpenter.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/164229328489/Karpenter-giropops]
data.kubectl_file_documents.letsencrypt: Read complete after 0s [id=0d35e50690b8b7d4ff7e70e6ee54f4b6ea4d2673b7ecdf32ac7a89e94cb5eb7b]
data.kubectl_file_documents.karpenter: Reading...
data.kubectl_file_documents.karpenter: Read complete after 0s [id=cca87ae3705f5aa807aa778a8bc242d0a8c8ce897bbcc2ce9070231934b33c1b]
module.aws_auth.kubernetes_config_map.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.karpenter.data.aws_iam_policy_document.queue[0]: Reading...
module.karpenter.data.aws_iam_policy_document.queue[0]: Read complete after 0s [id=3811003128]
module.karpenter.aws_sqs_queue_policy.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/164229328489/Karpenter-giropops]
module.karpenter.data.aws_iam_policy_document.v033[0]: Reading...
module.karpenter.data.aws_iam_policy_document.v1[0]: Reading...
module.network.data.aws_eks_cluster.this: Read complete after 0s [id=giropops]
module.karpenter.aws_eks_access_entry.node[0]: Refreshing state... [id=giropops:arn:aws:iam::164229328489:role/giropops]
module.karpenter.data.aws_iam_policy_document.v1[0]: Read complete after 0s [id=3250741766]
module.karpenter.data.aws_iam_policy_document.v033[0]: Read complete after 0s [id=1545753079]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=giropops-2025100302452244430000001c]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=giropops-2025100302452245400000001d]
module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKS_CNI_Policy"]: Refreshing state... [id=giropops-2025100302452244320000001b]
module.karpenter.aws_iam_role_policy_attachment.node_additional["AmazonSSMManagedInstanceCore"]: Refreshing state... [id=giropops-2025100302452236960000001a]
module.karpenter.data.aws_iam_policy_document.controller[0]: Reading...
module.karpenter.aws_cloudwatch_event_target.this["instance_rebalance"]: Refreshing state... [id=KarpenterInstanceRebalance-20251003024522076100000018-KarpenterInterruptionQueueTarget]
module.karpenter.data.aws_iam_policy_document.controller[0]: Read complete after 0s [id=1545753079]
module.karpenter.aws_cloudwatch_event_target.this["instance_state_change"]: Refreshing state... [id=KarpenterInstanceStateChange-20251003024522072600000016-KarpenterInterruptionQueueTarget]
module.network.helm_release.cilium: Refreshing state... [id=cilium]
module.karpenter.aws_cloudwatch_event_target.this["spot_interrupt"]: Refreshing state... [id=KarpenterSpotInterrupt-20251003024522070900000014-KarpenterInterruptionQueueTarget]
module.karpenter.aws_cloudwatch_event_target.this["health_event"]: Refreshing state... [id=KarpenterHealthEvent-20251003024522079600000019-KarpenterInterruptionQueueTarget]
module.karpenter.aws_iam_policy.controller[0]: Refreshing state... [id=arn:aws:iam::164229328489:policy/KarpenterController-2025100302454752070000001e]
module.karpenter.aws_iam_role_policy_attachment.controller[0]: Refreshing state... [id=KarpenterController-20251003023534383100000001-2025100302454778050000001f]
module.network.helm_release.tetragon: Refreshing state... [id=tetragon]
aws_eks_addon.coredns: Refreshing state... [id=giropops:coredns]
module.helm.data.aws_region.current: Reading...
module.helm.helm_release.external_dns: Refreshing state... [id=external-dns]
module.helm.helm_release.karpenter: Refreshing state... [id=karpenter]
module.helm.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.helm.data.aws_caller_identity.current: Reading...
module.helm.data.aws_iam_policy_document.external_dns_policy: Reading...
module.helm.data.aws_subnets.public: Reading...
module.helm.data.aws_iam_policy_document.lb_controller_policy: Reading...
module.helm.data.aws_iam_policy_document.external_dns_policy: Read complete after 0s [id=2902363378]
module.helm.aws_iam_policy.external_dns_policy: Refreshing state... [id=arn:aws:iam::164229328489:policy/eks-external-dns-policy]
module.helm.data.aws_iam_policy_document.lb_controller_policy: Read complete after 0s [id=458242647]
module.helm.aws_iam_policy.load_balancer_controller_policy: Refreshing state... [id=arn:aws:iam::164229328489:policy/eks-load-balancer-controller-policy]
module.helm.data.aws_caller_identity.current: Read complete after 0s [id=164229328489]
module.helm.aws_iam_role.eks_external_dns: Refreshing state... [id=eks-external-dns-role]
module.helm.aws_iam_role.eks_ebs_csi_controller: Refreshing state... [id=ebs-csi-controller-role]
module.helm.aws_iam_role.eks_load_balancer_controller: Refreshing state... [id=eks-load-balancer-controller-role]
module.helm.kubernetes_service_account.aws_load_balancer_controller: Refreshing state... [id=kube-system/aws-load-balancer-controller]
module.helm.kubernetes_service_account.external_dns: Refreshing state... [id=kube-system/external-dns]
module.helm.aws_iam_role_policy_attachment.attach_external_dns_policy: Refreshing state... [id=eks-external-dns-role-20251003024736013600000024]
module.helm.aws_iam_role_policy_attachment.attach_ebs_csi_policy: Refreshing state... [id=ebs-csi-controller-role-20251003024736149600000026]
module.helm.kubernetes_service_account.eks_ebs_csi_controller: Refreshing state... [id=kube-system/ebs-csi-controller-sa]
module.helm.helm_release.ebs_csi_driver: Refreshing state... [id=aws-ebs-csi-driver]
module.helm.aws_iam_role_policy_attachment.attach_load_balancer_policy: Refreshing state... [id=eks-load-balancer-controller-role-20251003024736069700000025]
module.helm.helm_release.aws_load_balancer_controller: Refreshing state... [id=aws-load-balancer-controller]
module.helm.helm_release.ingress-nginx: Refreshing state... [id=ingress-nginx]
module.helm.data.aws_subnets.public: Read complete after 1s [id=us-east-1]
module.helm.helm_release.cert_manager: Refreshing state... [id=cert-manager]
module.helm.helm_release.jaeger: Refreshing state... [id=jaeger]
module.helm.helm_release.sonarqube: Refreshing state... [id=sonarqube]
module.helm.helm_release.argocd: Refreshing state... [id=argocd]
module.helm.helm_release.kube_prometheus_stack: Refreshing state... [id=kube-prometheus-stack]
module.aws_auth.kubernetes_config_map_v1_data.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.helm.helm_release.otel_collector: Refreshing state... [id=otel-collector]
module.helm.helm_release.tempo: Refreshing state... [id=tempo]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # kubectl_manifest.karpenter["/apis/karpenter.k8s.aws/v1/ec2nodeclasses/bottlerocket"] will be created
  + resource "kubectl_manifest" "karpenter" {
      + api_version             = "karpenter.k8s.aws/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "EC2NodeClass"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "bottlerocket"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.k8s.aws/v1
            kind: EC2NodeClass
            metadata:
              name: bottlerocket
            spec:
              amiSelectorTerms:
              - alias: bottlerocket@latest
              blockDeviceMappings:
              - deviceName: /dev/xvdb
                ebs:
                  deleteOnTermination: true
                  encrypted: true
                  iops: 3000
                  volumeSize: 20Gi
                  volumeType: gp3
              role: giropops
              securityGroupSelectorTerms:
              - tags:
                  karpenter.sh/discovery: giropops
              subnetSelectorTerms:
              - tags:
                  karpenter.sh/discovery: giropops
              tags:
                karpenter.sh/discovery: giropops
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.karpenter["/apis/karpenter.sh/v1/nodepools/bottlerocket"] will be created
  + resource "kubectl_manifest" "karpenter" {
      + api_version             = "karpenter.sh/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "NodePool"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "bottlerocket"
      + namespace               = (known after apply)
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: karpenter.sh/v1
            kind: NodePool
            metadata:
              name: bottlerocket
            spec:
              disruption:
                consolidateAfter: 30s
                consolidationPolicy: WhenEmpty
              limits:
                cpu: 5000
              template:
                metadata:
                  labels:
                    workload: apps
                spec:
                  nodeClassRef:
                    group: karpenter.k8s.aws
                    kind: EC2NodeClass
                    name: bottlerocket
                  requirements:
                  - key: node.kubernetes.io/instance-type
                    operator: In
                    values:
                    - t3.medium
                  - key: karpenter.sh/capacity-type
                    operator: In
                    values:
                    - on-demand
                  startupTaints:
                  - effect: NoSchedule
                    key: node.giropops.io/agent-not-ready
                    value: "true"
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # kubectl_manifest.letsencrypt["/apis/cert-manager.io/v1/namespaces/cert-manager/clusterissuers/letsencrypt-staging"] will be created
  + resource "kubectl_manifest" "letsencrypt" {
      + api_version             = "cert-manager.io/v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "ClusterIssuer"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "letsencrypt-staging"
      + namespace               = "cert-manager"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: cert-manager.io/v1
            kind: ClusterIssuer
            metadata:
              name: letsencrypt-staging
              namespace: cert-manager
            spec:
              acme:
                email: johnmonteiro78@yahoo.com
                privateKeySecretRef:
                  name: letsencrypt-staging
                server: https://acme-staging-v02.api.letsencrypt.org/directory
                solvers:
                - http01:
                    ingress:
                      ingressClassName: nginx
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.helm.helm_release.loki will be created
  + resource "helm_release" "loki" {
      + atomic                     = true
      + chart                      = "loki-stack"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "loki"
      + namespace                  = "monitoring"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://grafana.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "grafana":
                  "enabled": false
                "loki":
                  "auth_enabled": false
                  "commonConfig":
                    "replication_factor": 1
                  "enabled": true
                  "schemaConfig":
                    "configs":
                    - "from": "2024-01-01"
                      "index":
                        "period": "24h"
                        "prefix": "index_"
                      "object_store": "filesystem"
                      "schema": "v13"
                      "store": "tsdb"
                  "service":
                    "port": 3100
                    "type": "ClusterIP"
                  "serviceMonitor":
                    "enabled": true
                  "singleBinary":
                    "enabled": true
                  "storage":
                    "type": "filesystem"
                "promtail":
                  "config":
                    "clients":
                    - "url": "http://loki.monitoring.svc.cluster.local:3100/loki/api/v1/push"
                    "positions":
                      "filename": "/run/promtail/positions.yaml"
                    "scrape_configs":
                    - "job_name": "kubernetes-pods"
                      "kubernetes_sd_configs":
                      - "role": "pod"
                      "pipeline_stages":
                      - "cri": {}
                      - "regex":
                          "expression": ".*(?:trace[id|_id|Id]|otel.trace_id)=(?P<trace_id>[A-Za-z0-9]+).*"
                      - "labels":
                          "trace_id": ""
                      "relabel_configs":
                      - "source_labels":
                        - "__meta_kubernetes_pod_node_name"
                        "target_label": "node"
                      - "source_labels":
                        - "__meta_kubernetes_namespace"
                        "target_label": "namespace"
                      - "source_labels":
                        - "__meta_kubernetes_pod_name"
                        "target_label": "pod"
                      - "source_labels":
                        - "__meta_kubernetes_pod_container_name"
                        "target_label": "container"
                      - "source_labels":
                        - "__meta_kubernetes_pod_label_app_kubernetes_io_name"
                        "target_label": "app"
                      - "action": "replace"
                        "regex": "(.+)"
                        "source_labels":
                        - "__meta_kubernetes_pod_label_app"
                        "target_label": "app"
                      - "action": "replace"
                        "replacement": "/var/log/pods/*$1/*.log"
                        "source_labels":
                        - "__meta_kubernetes_pod_uid"
                        - "__meta_kubernetes_pod_container_name"
                        "target_label": "__path__"
                    "server":
                      "grpc_listen_port": 0
                      "http_listen_port": 3101
                  "enabled": true
                  "serviceMonitor":
                    "enabled": true
                    "labels":
                      "release": "kube-prometheus-stack"
            EOT,
        ]
      + verify                     = false
      + version                    = "2.10.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
